import 'package:flutter/material.dart';

class Firstaidkit {
  int id;
  String itemname , itemdesc , itemimage ;
  Color color;

  Firstaidkit(this.id, this.itemname, this.itemdesc , this.itemimage , this.color);
}

class Case {
  int id;
  String title , desc , how , image , danger;
  Color color;

  Case(this.id, this.title , this.image , this.desc , this.how , this.color, this.danger);
}

final List<Case> cases = [
  Case(1,'การห้ามเลือด','assets/images/cases/stanch.png',
      'การบาดเจ็บใดๆก็ตาม แม้จะเห็นเป็นบาดแผลายนอกเล็กๆ แต่อาจเป็นสาเหตุให้อวัยวะภายในบาดเจ็บรุนแรงได้ตลอดจนเป็นสาเหตุให้เลือดออกมาก ช็อก หัวใจหยุดเต้น',
      "1.ต้องคำนึงถึงความปลอดภัยในการป้องกันการติดเชื้อหากต้องสัมผัสแผลหรือเลือดของผู้ป่วยโดยตรงควรสวมถุงมือยางหรือวัสดุใกล้เคียงเช่นถุงพลาสติก \n2.แผลเล็กน้อยกดลงบริเวณบนแผล แผลใหญ่ขึ้นใช้ฝ่ามือกดบริเวณปลายแผล กดด้วยการใช้ผ้าสะอาดพับหนากดลงบนบาดแผลในกรณีฉุกเฉินใช้เสื้อผ้าเช็ดหน้าผ้าพันคอแต่ถ้าหากไม่มีจริงๆใช้ฝ่ามือกดลงตรงๆได้เลยประมาณ 10 นาทีถ้าเลือดยังไม่หยุดให้เติมผ้าชิ้นใหม่ลงบนชิ้นเดิมที่ปิดแผลอยู่แล้ว \n3.ใช้ผ้ายืดพันทับผ้าที่ปิดแผลเดิมไว้ \n4.ถ้าเลือดออกอย่างมากอย่าเสียเวลาทำแผลให้ใช้มือกดลงบนบาดแผลพร้อมทั้งยกส่วนนั้นให้สูงขึ้นเหนือระดับหัวใจ(เฉพาะกรณีที่ไม่มีกระดูกบริเวณนั้นหักร่วมด้วย \n5.หากเลือดยังไม่หยุดให้ใช้นิ้วมือกดตรงเส้นเลือดแดงที่มาเลี้ยงบริเวณแผลโดยกดติดกับกระดูกซึ่งจะทำให้ช่วยการไหลของเลือดช้าลงชั่วคราว"
      ,Colors.redAccent,"อย่ากดจนแขนหรือขำซีดหรือเขียว แล้วรีบส่งโรงพยาบาล"),
  Case(2,'ไฟฟ้าดูด','assets/images/cases/elec.png',
      'จุดของกระแสไฟฟ้าจะเป็นรอยไหม้สีน้ำตาล พบได้มากบริเวณที่จับอุปกรณ์ไฟฟ้า จุดที่กระแสไฟฟ้าออกจะเป็นรอยไหม้สีดำพบมากที่บริเวณเท้าร่างกาย',
      "1.ตรวจการหายใจ ถ้าผู้ประสบเหตุไม่หายใจต้องช่วยการหายใจ \n2.ตรวจดูชีพจรถ้าไม่เต้นให้ช่วยนวดหัวใจ\n3.ตรวจดูแผลไหม้เพื่อให้การปฐมพยาบาล \n4.นำส่งโรงพยาบาล "
      ,Colors.blueAccent,"ไม่สัมผัสผู้ถูกกระแสไฟฟ้าดูดก่อนตัดกระแสไฟ"),
  Case(3,'หมดสติจากการสูดดมสารเคมี','assets/images/cases/gas.png',
      'หากมีอาการวิงเวียนศรีษะปวดศีรษะแสบตาแสบจมูกหรือได้กลิ่นผิดปกติให้รีบออกจากบริเวณนั้นโดยทันที',
      "1.ออกจากบริเวณนั้นไปที่โล่ง\n2.เปิดประตูหน้าต่างเพื่อทำให้ความเข้มข้นของแก๊สจะจางลง\n3.ผู้ช่วยเหลือควรสวมหน้ากากป้องกันแก๊สพิษหรือเครื่องช่วยหายใจ\n4.รีบนำผู้ป่วยไปยังพื้นที่โลกแจ้งนำส่งโรงพยาบาล"
      ,Colors.teal[800],"ได้กลิ่นผิดปกติให้รีบออกจากบริเวณนั้นโดยทันที"),
  Case(4,'แผลไหม้จากสารเคมี','assets/images/cases/fire.png',
      'ห้ามเจาะถุงน้ำหรือตัดหนังส่วนที่พองออก บริเวณแผลที่ถูกสารเคมี',
      "1.ใช้ผ้าชุบน้ำประคบ,เปิดให้น้ำไหลผ่านประมาณ 10 นาที\n2.ทาด้วยยาทาแผลไหม้\n3.ปิดด้วยผ้าสะอาดเพื่อป้องกันการติดเชื้อ"
      ,Colors.purple[500],"ห้ามเจาะถุงน้ำหรือตัดหนังส่วนที่พองออกบริเวณแผลที่ถูกสารเคมี"),
];
final List<Firstaidkit> fak = [
  Firstaidkit(1,'ผ้าพันแผล',"ผ้าพันแผลแบ่งออกเป็นผ้าพันแผลกาว, ผ้าพันแผลของเหลว, ผ้าพันแผลผ้ากอซ, ผ้าพันแผลบีบอัด, ผ้าพันแผลสามเหลี่ยม, ผ้าพันแผลหลอด",
              "assets/images/Untitled1.png",Colors.purpleAccent[900]),
  Firstaidkit(2,'น้ำเกลือ',"ผ้าพันแผลแบ่งออกเป็นผ้าพันแผลกาว, ผ้าพันแผลของเหลว, ผ้าพันแผลผ้ากอซ, ผ้าพันแผลบีบอัด, ผ้าพันแผลสามเหลี่ยม, ผ้าพันแผลหลอด",
              "assets/images/Untitled2.png",Colors.purpleAccent[900]),            
];